#language: ru
Функционал: Homework

@all @rsg
  Сценарий: Росгосстрах
    * Перейти по ссылке http://www.rgs.ru
    * Выбрать пункт меню - страхование
    * Выбрать категорию - ДМС
    * Проверить наличие заголовка - Добровольное медицинское страхование
    * Нажать на кнопку -Отправить заявку
    * Проверить, что открылась страница , на которой присутствует текст -Заявка на добровольное медицинское страхование
    * Заполнение полей
    * Проверить, что все поля заполнены введенными значениями
    * Нажать Отправить
    * Проверить, что у Поля -Эл. почта присутствует сообщение об ошибке -Введите корректный email

  @all @sber
  Сценарий: Сбербанк
    * Перейти на страницу http://www.sberbank.ru/ru/person
    * Нажать на – Страхование
    * Выбрать – Путешествие и покупки
    * Проверить наличие на странице заголовка – Страхование путешественников
    * Нажать на – Оформить Онлайн
    * На вкладке – Выбор полиса  выбрать сумму страховой защиты – Минимальная
    * Нажать Оформить
    * На вкладке Оформить заполнить поля:
    * Проверить, что все поля заполнены правильно
    * Нажать продолжить
    * Проверить, что появилось сообщение - Заполнены не все обязательные поля